In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'D:\Notes\Excel works\marks_dataset_with_blanks.csv')
df

   StudentID        Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
0          1  Anil Kumar     85.0         78   92.0       NaN   80.0     88.0
1          2  Bharathi R     90.0         80   88.0      94.0   85.0     55.0
2          3   Chandan S     78.0         84    NaN      86.0    NaN     81.0
3          4     Divya P      NaN         79   84.0      88.0   82.0     85.0
4          5    Eshwar N     88.0         91   89.0      90.0   45.0     79.0
5          6     Farah K     76.0         85   95.0      80.0   88.0      NaN

In [4]:
branch_group = df.groupby(by='Physics')
branch_group

In [5]:
branch_group.groups

{76.0: [5], 78.0: [2], 85.0: [0], 88.0: [4], 90.0: [1]}

In [10]:
branch_group = df.groupby(by=['StudentID','Physics'])
branch_group.groups

{(1, 85.0): [0], (2, 90.0): [1], (3, 78.0): [2], (4, nan): [3], (5, 88.0): [4], (6, 76.0): [5]}

In [11]:
for group,data_frame in branch_group:
    print(group)
    print(data_frame)

(np.int64(1), np.float64(85.0))
   StudentID        Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
0          1  Anil Kumar     85.0         78   92.0       NaN   80.0     88.0
(np.int64(2), np.float64(90.0))
   StudentID        Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
1          2  Bharathi R     90.0         80   88.0      94.0   85.0     55.0
(np.int64(3), np.float64(78.0))
   StudentID       Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
2          3  Chandan S     78.0         84    NaN      86.0    NaN     81.0
(np.int64(5), np.float64(88.0))
   StudentID      Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
4          5  Eshwar N     88.0         91   89.0      90.0   45.0     79.0
(np.int64(6), np.float64(76.0))
   StudentID     Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
5          6  Farah K     76.0         85   95.0      80.0   88.0      NaN

In [12]:
df1 = pd.DataFrame({'usn':[1,2,3],'phy':[100,80,81]})
df1

   usn  phy
0    1  100
1    2   80
2    3   81

In [15]:
df2 = pd.DataFrame({'usn':[1,2,3],'math':[85,100,91]})
df2

   usn  math
0    1    85
1    2   100
2    3    91

In [16]:
pd.merge(df1,df2, on='usn')

   usn  phy  math
0    1  100    85
1    2   80   100
2    3   81    91

In [19]:
df3 = pd.DataFrame({'usn':[1,2,3,6,7],'phy':[100,80,81,67,78]})
df4 = pd.DataFrame({'usn':[1,2,3,8,9],'math':[78,56,47,79,80]})
pd.merge(df3,df4,on='usn')

   usn  phy  math
0    1  100    78
1    2   80    56
2    3   81    47

In [20]:
pd.merge(df3,df4,how='left')

   usn  phy  math
0    1  100  78.0
1    2   80  56.0
2    3   81  47.0
3    6   67   NaN
4    7   78   NaN

In [21]:
pd.merge(df3,df4,how='right')

   usn    phy  math
0    1  100.0    78
1    2   80.0    56
2    3   81.0    47
3    8    NaN    79
4    9    NaN    80

In [22]:
pd.merge(df3,df4,how='outer')

   usn    phy  math
0    1  100.0  78.0
1    2   80.0  56.0
2    3   81.0  47.0
3    6   67.0   NaN
4    7   78.0   NaN
5    8    NaN  79.0
6    9    NaN  80.0

In [27]:
df5 = pd.DataFrame({'usn':[8,9,10,11,12],'phy':[78,56,47,79,80]})
df3.append(df5)

AttributeError: 'DataFrame' object has no attribute 'append'